{
  "about": {
    "title": "🚀 The Full-Stack \"Swiss Army Knife\" (with a Lead Engineer's Brain)",
    "summary": "<div class=\"professional-bio\"><p class=\"tagline\">7+ years. Zero fluff. Infinite scale.</p><p class=\"intro\">I don't just write code; I build digital engines that don't know how to quit. As a Lead Full-Stack Engineer, I've spent the last decade turning \"impossible\" architectures into high-performance reality. From the invisible magic of backend systems to the \"pixel-perfect\" polish of modern frontends, I bridge the gap between business dreams and technical muscle.</p><h2>🛠️ My Secret Sauce</h2><div class=\"secret-sauce\"><p><strong>The Big Picture:</strong> I own the entire SDLC. I don't just ship features; I streamline the factory that builds them using CI/CD pipelines and GenAI-powered workflows.</p><p><strong>Data-Driven DNA:</strong> I'm obsessed with observability. If it moves, I track it. I use custom scripting and real-time dashboards to hunt down bugs before they even realize they're bugs.</p><p><strong>UI/UX with an Edge:</strong> I believe a backend is only as good as the interface it feeds. I build modular, intuitive frontends that users actually want to touch.</p><p><strong>Business Mindset:</strong> Tech for tech's sake is a hobby. Tech for growth is a mission. I align every architectural decision with the bottom line.</p></div></div>",
    "contact": {
      "email": "arvind2221994@gmail.com",
      "location": "Bengaluru, KA, India",
      "linkedin": "https://www.linkedin.com/in/arvindn1994/",
      "github": "https://github.com/arvind2221994"
    }
  },
  "experience": [
    {
      "title": "Technology Lead",
      "company": "Infogain India Pvt. Ltd.",
      "duration": "May 2025 - Present",
      "description": "As a high-velocity Tech Lead, I orchestrated the delivery of 20+ features across 7 codebases and 3 tech stacks in just 3 months, while simultaneously boosting SEO performance by 20% and slashing technical debt by 35% through Agentic AI and proactive system optimization.",
      "achievements": [
        "Demonstrated leadership in feature development and optimization for a team of 6, resulting in a 20% improvement in Google Search Console listings across 20 high-traffic websites.",
        "Spearheaded a codebase refactoring initiative, reducing technical debt and improving SonarQube compliance by 35% and resolving package vulnerabilities.",
        "Automated technical backlog identification by using agentic AI, reducing planning time by 30%.",
        "Devised innovative solutions to feature requests, that helped identify deeper systemic issues and improve product reliability and reduce defects by at least 15 percent.",
        "Proactively monitored, triaged and fixed production defects utilizing Datadog and GTM for real-user monitoring, analytics, and rapid troubleshooting.",
        "Pioneered LLM-assisted documentation and runbook development, for effective knowledge base creation and streamlined the onboarding of new engineers."
      ]
    },
    {
      "title": "Senior Software Developer",
      "company": "Infogain India Pvt. Ltd.",
      "duration": "Oct 2023 - Jan 2025",
      "description": "Drove end-to-end feature development and optimization across modern web stacks, leveraging OOP, DSA, and advanced caching strategies to deliver measurable improvements in lead analytics, performance, and deployment efficiency.",
      "achievements": [
        "Increased lead analytics by over 10% by developing a new lead capture flow utilizing Object Oriented Programming in TypeScript, resulting in a refined and responsive user experience.",
        "Leveraged strong knowledge of Data Structures and Algorithms (DSA) and Singleton design patterns to implement features to scale and efficient resource management.",
        "Engineered and contributed to efficient cache handling solutions using IndexedDB and web workers in frontend for more performant applications, and Redis and Cloudflare in backend, improving overall asset delivery speed.",
        "Automated workflows and CI/CD pipelines, successfully reducing deployment time by 70%.",
        "Achieved 85% code coverage and used prompt engineering on AI agents to resolve issues flagged by SonarCloud and perform unit testing in Jest and package dependency issues.",
        "Designed a RESTful tracking application using React to monitor key business metrics, providing stakeholders with immediate insights.",
        "Implemented Server-side rendering (SSR) in NodeJS backend, resulting in a measurable improvement in Core Web Vital scores and SEO performance.",
        "Directed Root Cause Analysis (RCA) and debugging sessions to systematically analyze system defects, server discrepancies, and evolving lead capture patterns, ensuring system reliability."
      ]
    },
    {
      "title": "Member of Technical Staff",
      "company": "Cerebras Inc.",
      "duration": "Jan 2023 - Jun 2023",
      "description": "Developed internal tooling to streamline LLM testing workflows and database management.",
      "achievements": [
        "Developed the Bootstrap-based internal tool, utilized by LLM testers to manage their test result database, resulting in a 30% boost in cycle time and cost reduction."
      ]
    },
    {
      "title": "Software Engineer in Test",
      "company": "MathWorks India",
      "duration": "Jul 2016 - Dec 2022",
      "description": "Led comprehensive quality assurance initiatives across platform testing, automation, and customer issue resolution, while mentoring junior engineers and driving product quality improvements through innovative testing methodologies.",
      "achievements": [
        "Spearheaded regression and platform testing, uncovering over 200 critical issues and driving company-wide qualification for two broad-impact features, significantly reducing product risk and triaging over 10,000 reported customer issues.",
        "Developed core system service wrappers using C++ and the Qt framework, including the creation of mocking frameworks that significantly improved unit testability and code reliability.",
        "Innovated multiple image processing algorithms to automate rigorous testing of graphics and UI features across product builds, enhancing quality assurance coverage.",
        "Actively participated in cross-functional design reviews with all stakeholders, raising key issues concerning testability and influencing product architecture for increased robustness.",
        "Authored over 35 comprehensive test procedures and developed 50+ automated tests using Google Test (C++), QUnit, and Selenium (JavaScript), to achieve more than 80% coverage.",
        "Awarded the internal Hall of Fame twice for consistently identifying the maximum number of critical issues during internal product testing, demonstrating exceptional bug detection skills.",
        "Introduced a data-driven methodology to optimize customer issue resolution metrics by leveraging Power BI insights, improving the efficiency of the support pipeline.",
        "Mentored over 20 interns and freshers on effective testing methodologies and best practices, fostering a culture of continuous quality improvement across the organization."
      ]
    }
  ],
  "education": [
    {
      "degree": "Master of Science in Computer Science",
      "institution": "University Name",
      "duration": "2018 - 2020",
      "details": "Focus on Software Engineering and Machine Learning"
    },
    {
      "degree": "Bachelor of Science in Computer Science",
      "institution": "University Name",
      "duration": "2014 - 2018",
      "details": "GPA: 3.8/4.0"
    }
  ],
  "skills": [
    {
      "category": "Frontend & Design",
      "skills": ["HTML", "CSS", "Tailwind", "Javascript", "Typescript", "ReactJS", "Bootstrap", "Figma", "Crownpeak CMS", "Chrome Dev Tools", "Web workers", "IndexedDB", "Redux", "Sockets"]
    },
    {
      "category": "Back-end development",
      "skills": ["Node.js", "C++", "REST API", "Postman", "ADB2C", "GraphQL", "AWS SDK"]
    },
    {
      "category": "Cloud infrastructure",
      "skills": ["AWS S3", "AWS Lambda", "AWS EKS", "Cloudwatch", "NLB", "SQS", "IAM", "KMS", "GCP Cloud Run", "Firebase", "Pub/Sub", "Cloudflare", "Redis"]
    },
    {
      "category": "DevOps & Monitoring",
      "skills": ["Python", "AzureDevOps", "Git", "SonarQube", "Datadog", "Google Search Console", "Docker"]
    },
    {
      "category": "Generative AI",
      "skills": ["Copilot", "Gemini", "Model Context Protocol (MCP)", "Agentic AI", "Prompt Engineering", "BMAD"]
    },
    {
      "category": "Certifications & Courses",
      "skills": ["Github Copilot GH 300 Certification", "Prompt Engineering (Coursera)", "Amazon Bedrock (Amazon Workshops)", "GCP Firebase & Cloud Run (Google Cloud Skills)"]
    }
  ],
  "projects": [
    {
      "title": "Project Name 1",
      "description": "A brief description of what this project does and the problem it solves.",
      "technologies": ["React", "Node.js", "MongoDB"],
      "link": "https://project1.com",
      "github": "https://github.com/yourusername/project1"
    },
    {
      "title": "Project Name 2",
      "description": "Another project description highlighting key features and impact.",
      "technologies": ["Python", "Django", "PostgreSQL"],
      "github": "https://github.com/yourusername/project2"
    },
    {
      "title": "Project Name 3",
      "description": "Description of a third project showcasing different skills.",
      "technologies": ["TypeScript", "Vue.js", "Express"],
      "link": "https://project3.com"
    }
  ]
}
